# 결측치와 이상치
## 결측치
### 결측치 인식

In [3]:
import pandas as pd
obj={'student_id':['s1','s2','s3','s4','s5','s6'],
    'stat_score':[None,90,85,71,63,None],
    'math_score':[65,None,87,75,57,88],
    'sex':['Female','Male','Female',None,'Male','Male'],
    'pre_level':['B','A','B','B','C',None]}
df=pd.DataFrame(obj)
df

  student_id  stat_score  math_score     sex pre_level
0         s1         NaN        65.0  Female         B
1         s2        90.0         NaN    Male         A
2         s3        85.0        87.0  Female         B
3         s4        71.0        75.0    None         B
4         s5        63.0        57.0    Male         C
5         s6         NaN        88.0    Male      None

In [4]:
# .isnull() 결측치확인
df.isnull()

   student_id  stat_score  math_score    sex  pre_level
0       False        True       False  False      False
1       False       False        True  False      False
2       False       False       False  False      False
3       False       False       False   True      False
4       False       False       False  False      False
5       False        True       False  False       True

In [5]:
# .isna(): 결측치 여부 확인
df.isna()

   student_id  stat_score  math_score    sex  pre_level
0       False        True       False  False      False
1       False       False        True  False      False
2       False       False       False  False      False
3       False       False       False   True      False
4       False       False       False  False      False
5       False        True       False  False       True

In [6]:
# 컬럼별 결측치 개수
df.isnull().sum()

student_id    0
stat_score    2
math_score    1
sex           1
pre_level     1
dtype: int64

In [7]:
# 행별 결측치 개수
df.isnull().sum(axis=1)

0    1
1    1
2    0
3    1
4    0
5    2
dtype: int64

### 결측치 처리

In [8]:
# .dropna()
# 결측치가 있는 행을 모두 제거
df.dropna()

  student_id  stat_score  math_score     sex pre_level
2         s3        85.0        87.0  Female         B
4         s5        63.0        57.0    Male         C

In [9]:
# 열도 가능
df.dropna(axis=1)

  student_id
0         s1
1         s2
2         s3
3         s4
4         s5
5         s6

In [10]:
# 'stat_score'컬럼 (시리즈)에서 결측인 요소 제거
df['stat_score'].dropna()

1    90.0
2    85.0
3    71.0
4    63.0
Name: stat_score, dtype: float64

In [11]:
# 'stat_score'과 'math_score'컬럼 중
# 결측치가 있는 모든 행을 제거
df[['stat_score','math_score']].dropna()

   stat_score  math_score
2        85.0        87.0
3        71.0        75.0
4        63.0        57.0

In [13]:
# 숫자형 컬럼만 추출
df1=df[['stat_score','math_score']].copy()  # copy()원본 소실 방지
df1

   stat_score  math_score
0         NaN        65.0
1        90.0         NaN
2        85.0        87.0
3        71.0        75.0
4        63.0        57.0
5         NaN        88.0

In [16]:
# .fillna
# 결측치를 모두 0으로 대치
#df1.fiilna(0)

### 이상치

In [20]:
# 데이터프레임 생성
obj={'student_id':['s1','s2','s3','s4','s5','s6'],
     'stat_score':[55,90,85,10,88,99],
     'math_score':[65,99,67,70,57,80]}
df=pd.DataFrame(obj)
df

  student_id  stat_score  math_score
0         s1          55          65
1         s2          90          99
2         s3          85          67
3         s4          10          70
4         s5          88          57
5         s6          99          80

In [22]:
# 'stat_score' 컬럼에 대하여 이상치를 판별하고 제거
q1=df['stat_score'].quantile(0.25)  # 제1사분위수
q3=df['stat_score'].quantile(0.75)  # 제3사분위수
iqr=q3-q1   # IQR
lower=q1-1.5*iqr    # lower whisker
upper=q3+1.5*iqr    # upper whisker

# 이상치판별
# upper whisker보다 크거나 lower whisker 보다 작은 값들
df[(df['stat_score']<lower)|(df['stat_score']>upper)]

  student_id  stat_score  math_score
3         s4          10          70

In [23]:
# 이상치 제거
df[(df['stat_score']>lower)&(df['stat_score']<upper)]

  student_id  stat_score  math_score
0         s1          55          65
1         s2          90          99
2         s3          85          67
4         s5          88          57
5         s6          99          80